{
  "basics": {
    "name": "Muhammad Farhan",
    "label": "AI and Automation Engineer",
    "image": "",
    "email": "farhanzafrani@gmail.com",
    "phone": "(+92) 312 9317210",
    "url": "https://farhanzafrani.github.io/cv/",
    "summary": "A AI and Automation Engineer having an experience of about 1 year, working on multi-disciplinary and computational problems to reduce the simulation time and increase the productivity/performance of BMW Group CAE Research Projects.",
    "location": {
      "address": "6 No. Chungi Gulgasht",
      "postalCode": "92010",
      "city": "Multan",
      "countryCode": "Pakistan",
      "region": "Punjab"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Muhammad Farhan",
        "url": "https://www.linkedin.com/farhanzafrani"
      }
    ]
  },
  "work": [
    {
      "name": "SOCO Engineers, Multan",
      "position": "AI and Automation Engineer",
      "url": "https://www.soco-engineers.de",
      "startDate": "2023-12-15",
      "endDate": "Present",
      "summary": "Optimized simulation processes, reducing design iterations by 15% and accelerating design optimization with surrogate modeling. Developed and deployed a high-throughput FEA automation framework using ANSA, Abaqus, Optistruct, and Python.Collaborated on automation solutions, saving engineering hours, and contributed FEA expertise to autonomous driving system safety.",
      "highlights": ["Optimization", "Automation"]
    },
    {
      "name": "Human System Lab, SMME, NUST Islamabad",
      "position": "Research Assistant",
      "url": "https://smme.nust.edu.pk/",
      "startDate": "2022-09-5",
      "endDate": "2023-05-05",
      "summary": "Designed and fabricated a Soft Robotic Glove for stroke rehabilitation assisting   with EMG data analysis and mechanical modeling. Achieved 92% accuracy on real-time data and 98% on offline data by analyzing machine learning models with Fitt’s Law.Developed a real-time EMG data protocol and controlled the Soft Robotic Glove using Raspberry Pi 4",
      "highlights": ["Soft Robotics", "EMG"]
    },
    {
        "name": "Machine Learning Intern",
        "position": "School of Mechanical and Manufacturing Engineerins (SMME), NUST Islamabad",
        "startDate": "2022-05-01",
        "endDate": "2022-09-01",
        "summary":"Predicted hand gestures using EMG data and machine learning algorithms, achieving 96% accuracy on a generalized test dataset. Designed a data acquisition protocol for Trigo Delsys and collected EMG data from 15 healthy subjects for ML training. Programmed hand-gesture-controlled games, noting overfitting in boosting algorithms like XGBoost and AdaBoost."
    }
  ],
  "volunteer": [
    {
      "organization": "Bzm-e-Paigham",
      "location": "Islamabad, Pakistan",
      "position": "Lead Organizer",
      "url": "https://bazmepaigham.com/",
      "startDate": "Mar 2022",
      "endDate": "Present",
      "summary": "Participate in their Career Campaign *Make the Diamond shine* to motivate the student about their future goals and studies. Worked with them for the 2-week-long campaign in which we visited 4 indigenous schools of Islamabad.",
      "highlights": [" Covered above 400 students group-wise, to educate them about *How to study?*", "Motivate them to apply for the scholarships available for them in the area to fund their studies", "Work on their personal skills and guide them to become a better citizens of Pakistan"]
    }
  ],
  "education": [
    {
      "institution": "National University of Sciences and Technology (NUST)",
      "location": "Islamabad",
      "url": "https://nust.edu.pk/",
      "area": "Mechanical Engineering",
      "studyType": "BE Mechanical",
      "startDate": "2019-09-01",
      "endDate": "2023-06-05",
      "score": "3.42",
      "courses": ["Mechanics of Machines", "Finite Element Analysis", "Fluid Dynamics"]
    },
    {
      "institution": "Ali Trust College",
      "location": "Islamabad",
      "url": "https://atc.edu.pk/",
      "area": "Intermediate",
      "studyType": "Pre-Engineering",
      "startDate": "2017-04-01",
      "endDate": "2019-06-05",
      "score": "982/1100",
      "courses": ["Advanced Physics", "Calculas", "Analytical Geometry"]
    }
  ],
  "awards": [
    {
      "title": "NGIRI - Winner",
      "date": "2023-06-05",
      "awarder": "Ignite, Pakistan",
      "url": "https://ignite.org.pk/national-grassroots-research-initiative/",
      "summary": "Our Final Year Project was awarded funding of worth 0.1 million PKR by the government of Pakistan under the IGNITE National Technology Fund program..'"
    },
    {
      "title":"FICS-Finalist",
      "date":"2023-03-05",
      "awarder":"FICS-NUST",
      "url":"https://fics.nust.edu.pk/about/",
      "summary":"Our start-up idea, “REHABOTICS”, won 1st position in the Idea submission stage of Pakistan’s largest start-up competition, wherein more than 450 ideas were presented in the year 2023."
    }
  ],
  "certificates": [
    {
      "name": "Deep Learning Specialization",
      "date": "2018-01-01",
      "issuer": "deeplearning.ai & Stanford University",
      "url": "https://www.deeplearning.ai/courses/deep-learning-specialization/",
      "icon": "fa-solid fa-location-dot"
    },
    {
      "name": "Mathematics for Machine Learning and Data Science",
      "date": "2023-05-01",
      "issuer": "deeplearning.ai",
      "url": "https://www.deeplearning.ai/courses/mathematics-for-machine-learning-and-data-science-specialization/",
      "icon": "fa-solid fa-tag"
    }
  ],
  "publications": [
    {
      "name": "Development of Raspberry Pi Based sEMG Driven Standalone Upper Limb Rehabilitation Training System: A Human-Computer Interaction",
      "publisher": "IEEE Conference on Future Technologies",
      "releaseDate": "NOT IN SCOPE",
      "url": "https://drive.google.com/file/d/1b2-XBPS7KAM8xCRLdZjuytp6QmKLtjvg/view?usp=drive_link",
      "summary": "This study introduces a new approach to stroke rehabilitation by turning traditional physiotherapy exercises into interactive video games. Recognizing that conventional stroke therapy can be repetitive and boring, the researchers developed a system that uses pattern recognition to make the process more engaging for upper limb stroke patients. The system features two games that mimic physiotherapy exercises, designed to improve motor function in the arms. Using a Myo armband, the team collected muscle activity data (sEMG) from ten healthy participants to train a decision tree algorithm. When tested, the system showed promising results, with the algorithm achieving over 91% accuracy in offline tests and nearly 98% accuracy in real-time gameplay. These findings suggest that gamified rehabilitation could be an effective and enjoyable way to help stroke patients regain motor function."
    },
    {
      "name": "An sEMG-Driven Multiple DOFs Interactive Games Based Rehabilitation Protocol for Stroke Patients: Assessing Real-Time User Performance Feedback",
      "publisher": "Heliyon",
      "releaseDate": "under-Review",
      "url": "https://drive.google.com/file/d/1exc5NO3Zd9RgTKycTV_uLrmE2NN-wFxM/view?usp=drive_link",
      "summary": "This study explores the effectiveness of interactive home-based rehabilitation (HBR) using a 2D video game designed for stroke patients with hemiparetic hands. While video game-based therapy (VGT) is a common method for upper limb rehabilitation, many existing approaches lack real-time feedback and clinical usability. The proposed rehabilitation protocol was tested over three weeks with ten healthy individuals and two chronic stroke patients, measuring performance through Fitt’s law. Significant improvements were observed in stroke patients, with increased scores, completion rates, and throughput over time, suggesting that the protocol holds promise for effective stroke rehabilitation."
    }
  ],
  "skills": [
    {
      "name": "Machine Learning",
      "level": "Expert",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Regression Algorithms",
        "Classification Algorithms",
        "Ensemble Learning",
        "Boosting Algorithms",
        "Clustring Algorithms"
      ]
    }
  ],
  "languages": [
    {
      "language":"Pashto",
      "fluency":"Native Language",
      "icon":""
    },
    {
      "language": "Urdu",
      "fluency": "National Language",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Computational Scieces",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Machine Learning",
        "Optimization Techniques",
        "Deep learning",
        "LLMs",
        "Generative AI",
        "Finite Element Analysis"
      ]
    }
  ],
  "references": [
    {
      "name": " Dr. Muhammad Asim Waris",
      "icon": "fa-solid fa-laptop",
      "reference": "Dr. Muhammad Asim Waris is an Assistant Professor at the Aerospace department SMME, NUST. He was my supervisor for the bachelor's (BE) final year project, and currently, I was working with him as a research assistant on a research project at the Human System Lab, SMME, NUST."
    },
    {
      "name": " Dr. Ibraheem Haneef",
      "icon": "fa-solid fa-thumbtack",
      "reference": "Dr. Ibraheem Haneef is a Professor at the Aerospace department SMME, NUST. He has taught me Project Management and also coordinated me in my final year project. I took a workshop of Practical Reinforcement Learning under his supervision."
    }
  ],
  "projects": [
    {
      "name": "Design and Fabrication of Soft Robotics Glove for the Rehabilitation of Stroke Patients using EMG data and Pattern Recognition Techniques",
      "summary": "Fabricated a right hand Soft Robotic Glove to assist the Stroke Patients in their Rehabilitation. Casted the Soft Robotic Actuators using Ecoflex 00-30 (silicone) that is an synthesized elastomer used in pneumatic based Soft Robotics. Achieved the desired bending using lower pressure of 60 Kpa. Controlled the actuator using the Raspberry PI 4 that was programmed using Python based on Machine Learning algorithms. Designed the Actuator using CAD software and simulated the actuator using ANSYS workbench for pressure requirements that came out to be 60 Kpa for single Actuator. Achieved an accuracy of 92% in prediction of the true hand gesture that ultimately controlled the actuator to rehabilitate the Stroke Patient Hand through Robotic Glove",
      "highlights": ["Soft Robotics", "EMG", "Machine Learning"],
      "startDate": "2022-06-01",
      "endDate": "2023-06-05",
      "url": "https://example.com"
    }
  ]
}
